keyboardio/Arduino_STM32/STM32F1/boards.txt
# STM32 Boards

menu.device_variant=Variant
menu.bootloader_version=Bootloader version
menu.upload_method=Upload method
menu.cpu_speed=CPU Speed(MHz)
menu.opt=Optimize

####
keyboardio_model_100.build.vid=0x3496
keyboardio_model_100.build.pid=0x0006
keyboardio_model_100.build.usb_product="Model 100"
keyboardio_model_100.build.usb_manufacturer="Keyboardio"
keyboardio_model_100.name=Keyboardio Model 100
keyboardio_model_100.build.variant=keyboardio_model100
keyboardio_model_100.build.vect=VECT_TAB_ADDR=0x8000000
keyboardio_model_100.build.core=maple
keyboardio_model_100.build.board=GENERIC_STM32F103C
keyboardio_model_100.build.error_led_port=GPIOC
keyboardio_model_100.build.error_led_pin=13
keyboardio_model_100.build.f_cpu=72000000L
keyboardio_model_100.upload.use_1200bps_touch=false
keyboardio_model_100.upload.file_type=bin
keyboardio_model_100.upload.auto_reset=true
keyboardio_model_100.upload.tool=maple_upload
keyboardio_model_100.upload.protocol=maple_dfu
keyboardio_model_100.build.cpu_flags=-DMCU_STM32F103C6
keyboardio_model_100.build.ldscript=ld/jtag.ld
keyboardio_model_100.build.mcu=cortex-m4
keyboardio_model_100.upload.maximum_size=1048576
keyboardio_model_100.upload.maximum_data_size=98304
keyboardio_model_100.build.extra_flags= {build.upload_flags} {build.cpu_flags} {build.hs_flag} {build.common_flags} '-DKALEIDOSCOPE_HARDWARE_H="Kaleidoscope-Hardware-Keyboardio-Model100.h"' '-DUSB_PRODUCT="gd32"' -DKEYBOARDIO_MODEL_100 -DUSBCON -DKBIO_TEST -DARDUINO_keyboardio_model_100


#---------------------------- UPLOAD METHODS ---------------------------

keyboardio_model_100.menu.upload_method.STLinkMethod=STLink
keyboardio_model_100.menu.upload_method.STLinkMethod.upload.protocol=STLink
keyboardio_model_100.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
keyboardio_model_100.menu.upload_method.STLinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER
keyboardio_model_100.menu.upload_method.DFUUploadMethod=STM32duino bootloader
keyboardio_model_100.menu.upload_method.DFUUploadMethod.upload.protocol=maple_dfu
keyboardio_model_100.menu.upload_method.DFUUploadMethod.upload.tool=maple_upload
keyboardio_model_100.menu.upload_method.DFUUploadMethod.build.upload_flags=-DSERIAL_USB -DGENERIC_BOOTLOADER
keyboardio_model_100.menu.upload_method.DFUUploadMethod.build.vect=VECT_TAB_ADDR=0x8002000
keyboardio_model_100.menu.upload_method.DFUUploadMethod.upload.usbID=1EAF:0003
keyboardio_model_100.menu.upload_method.DFUUploadMethod.build.ldscript=ld/bootloader.ld
keyboardio_model_100.menu.upload_method.DFUUploadMethod.upload.altID=2
keyboardio_model_100.menu.upload_method.DFUUploadMethod.upload.maximum_size=1024000
keyboardio_model_100.menu.upload_method.DFUUploadMethod.build.flash_offset=0x2000


#-- Optimizations
keyboardio_model_100.menu.opt.osstd=Smallest (default)
#keyboardio_model_100.menu.opt.oslto=Smallest Code with LTO
#keyboardio_model_100.menu.opt.oslto.build.flags.optimize=-Os -flto
#keyboardio_model_100.menu.opt.oslto.build.flags.ldspecs=-flto
keyboardio_model_100.menu.opt.o1std=Fast (-O1)
keyboardio_model_100.menu.opt.o1std.build.flags.optimize=-O1
keyboardio_model_100.menu.opt.o1std.build.flags.ldspecs=
#keyboardio_model_100.menu.opt.o1lto=Fast (-O1) with LTO
#keyboardio_model_100.menu.opt.o1lto.build.flags.optimize=-O1 -flto
#keyboardio_model_100.menu.opt.o1lto.build.flags.ldspecs=-flto
keyboardio_model_100.menu.opt.o2std=Faster (-O2)
keyboardio_model_100.menu.opt.o2std.build.flags.optimize=-O2
keyboardio_model_100.menu.opt.o2std.build.flags.ldspecs=
#keyboardio_model_100.menu.opt.o2lto=Faster (-O2) with LTO
#keyboardio_model_100.menu.opt.o2lto.build.flags.optimize=-O2 -flto
#keyboardio_model_100.menu.opt.o2lto.build.flags.ldspecs=-flto
keyboardio_model_100.menu.opt.o3std=Fastest (-O3)
keyboardio_model_100.menu.opt.o3std.build.flags.optimize=-O3
keyboardio_model_100.menu.opt.o3std.build.flags.ldspecs=
#keyboardio_model_100.menu.opt.o3lto=Fastest (-O3) with LTO
#keyboardio_model_100.menu.opt.o3lto.build.flags.optimize=-O3 -flto
#keyboardio_model_100.menu.opt.o3lto.build.flags.ldspecs=-flto
keyboardio_model_100.menu.opt.ogstd=Debug (-g)
keyboardio_model_100.menu.opt.ogstd.build.flags.optimize=-Og
keyboardio_model_100.menu.opt.ogstd.build.flags.ldspecs=

==============

mapleMini.name=Maple Mini

mapleMini.build.board=MAPLE_MINI
mapleMini.vid.0=0x1EAF
mapleMini.pid.0=0x0004
mapleMini.build.core=maple
mapleMini.build.cpu_flags=-DMCU_STM32F103CB -DSERIAL_USB
mapleMini.build.variant=maple_mini
mapleMini.upload.usbID=1EAF:0003

mapleMini.upload.tool=maple_upload
mapleMini.upload.protocol=maple_dfu
mapleMini.upload.use_1200bps_touch=false
mapleMini.upload.file_type=bin
mapleMini.upload.auto_reset=true

mapleMini.menu.bootloader_version.original = Original (17k RAM,108k Flash)
mapleMini.menu.bootloader_version.original.build.vect=VECT_TAB_ADDR=0x8005000
mapleMini.menu.bootloader_version.original.build.ldscript=ld/flash.ld
mapleMini.menu.bootloader_version.original.upload.maximum_size=110592
mapleMini.menu.bootloader_version.original.upload.maximum_data_size=17408
mapleMini.menu.bootloader_version.original.upload.altID=1

mapleMini.menu.bootloader_version.bootloader20 = Bootloader 2.0 (20k RAM,120k Flash)
mapleMini.menu.bootloader_version.bootloader20.build.vect=VECT_TAB_ADDR=0x8002000
mapleMini.menu.bootloader_version.bootloader20.build.ldscript=ld/bootloader_20.ld
mapleMini.menu.bootloader_version.bootloader20.upload.maximum_size=122880
mapleMini.menu.bootloader_version.bootloader20.upload.maximum_data_size=20480
mapleMini.menu.bootloader_version.bootloader20.upload.altID=2

#-- CPU Clock frequency
mapleMini.menu.cpu_speed.speed_72mhz=72MHz (Normal)
mapleMini.menu.cpu_speed.speed_72mhz.build.f_cpu=72000000L

mapleMini.menu.cpu_speed.speed_48mhz=48MHz (Slow - with USB)
mapleMini.menu.cpu_speed.speed_48mhz.build.f_cpu=48000000L

mapleMini.menu.cpu_speed.speed_128mhz=Overclocked 128MHz NO USB SERIAL. MANUAL RESET NEEDED TO UPLOAD
mapleMini.menu.cpu_speed.speed_128mhz.build.f_cpu=128000000L

#-- Optimizations
mapleMini.menu.opt.osstd=Smallest (default)
#mapleMini.menu.opt.oslto=Smallest Code with LTO
#mapleMini.menu.opt.oslto.build.flags.optimize=-Os -flto
#mapleMini.menu.opt.oslto.build.flags.ldspecs=-flto
mapleMini.menu.opt.o1std=Fast (-O1)
mapleMini.menu.opt.o1std.build.flags.optimize=-O1
mapleMini.menu.opt.o1std.build.flags.ldspecs=
#mapleMini.menu.opt.o1lto=Fast (-O1) with LTO
#mapleMini.menu.opt.o1lto.build.flags.optimize=-O1 -flto
#mapleMini.menu.opt.o1lto.build.flags.ldspecs=-flto
mapleMini.menu.opt.o2std=Faster (-O2)
mapleMini.menu.opt.o2std.build.flags.optimize=-O2
mapleMini.menu.opt.o2std.build.flags.ldspecs=
#mapleMini.menu.opt.o2lto=Faster (-O2) with LTO
#mapleMini.menu.opt.o2lto.build.flags.optimize=-O2 -flto
#mapleMini.menu.opt.o2lto.build.flags.ldspecs=-flto
mapleMini.menu.opt.o3std=Fastest (-O3)
mapleMini.menu.opt.o3std.build.flags.optimize=-O3
mapleMini.menu.opt.o3std.build.flags.ldspecs=
#mapleMini.menu.opt.o3lto=Fastest (-O3) with LTO
#mapleMini.menu.opt.o3lto.build.flags.optimize=-O3 -flto
#mapleMini.menu.opt.o3lto.build.flags.ldspecs=-flto
mapleMini.menu.opt.ogstd=Debug (-g)
mapleMini.menu.opt.ogstd.build.flags.optimize=-Og
mapleMini.menu.opt.ogstd.build.flags.ldspecs=


